Repository: RanujaLiyanaarachchi/Final_Project
Catalog: Mobile_App/App/upay/lib/l10n/app_*.arb
Languages: si, ta

source: Hi There,
si: ආයුබෝවන්,
ta: வணக்கம்,

# welcome_to_UPay
source: Welcome Back To UPay
si: UPay වෙත පිළිගනිමු
ta: UPayக்கு வருக

# welcome_message
source: Easy ways to manage your finances
si: මුදල් කළමනාකරණය පහසු කිරීමේ මග
ta: உங்கள் செலவுகளை எளிதாக நிர்வகிக்கவும்

source: Let’s Begin
si: ඉදිරියට යමු
ta: ஆரம்பிக்கலாம்

source: Sign In
si: පිවිසෙන්න
ta: நுழை

source: NIC
si: හැඳුනුම්පත් අංකය
ta: ஐடி எண்

source: Email
si: ඊමේල්
ta: மின்னஞ்சல்

source: Password
si: මුරපදය
ta: கடவுச்சொல்

source: Forgot Password?
si: මුරපදය අමතකද?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# forgot_password_title
source: Forgot?
si: මුරපදය නැවත සකසන්න
ta: கடவுச்சொல் மீட்டமைக்கவும்

# enter_email_reset
source: Dont worry! It occurs. Please enter the email address linked with your account
si: ඔබේ ඊමේල් ලිපිනය ඇතුළත් කරන්න
ta: மீட்டமைக்க மின்னஞ்சலை உள்ளிடவும்

source: Send
si: යවන්න
ta: அனுப்பவும்

source: Reset Password
si: මුරපදය නැවත සකසන්න
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

source: New Password
si: නව මුරපදය
ta: புதிய கடவுச்சொல்

source: Confirm Password
si: මුරපදය තහවුරු කරන්න
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Confirm
si: තහවුරු කරන්න
ta: உறுதிப்படுத்தவும்

# password_updated
source: Update
si: මුරපදය යාවත්කාලීන කරන ලදී
ta: கடவுச்சொல் புதுப்பிக்கப்பட்டது

# password_success_message_1
source: Your password has been successfully updated. You can now use your new password to access your account securely.
si: ඔබේ මුරපදය සාර්ථකව යාවත්කාලීන කරන ලදී.
ta: உங்கள் கடவுச்சொல் வெற்றிகரமாக புதுப்பிக்கப்பட்டது.

# password_success_message_2
source: If you experience any issues or have any concerns, please don't hesitate to contact our support team for assistance.
si: දැන් ඔබට නව මුරපදය භාවිතා කර පිවිසිය හැක.
ta: தயவுசெய்து உள்நுழையவும்.

source: Welcome
si: සාදරයෙන් පිළිගනිමු
ta: வரவேற்கிறோம்

# agree_terms
source: Agree to our terms and conditions?
si: නියමයන් හා කොන්දේසි එකඟ වන්න
ta: நிபந்தனைகளை ஏற்கவும்

source: No
si: නැත
ta: இல்லை

source: Yes
si: ඔව්
ta: ஆம்

# terms_conditions
source: Terms and Conditions
si: නියමයන් හා කොන්දේසි
ta: விதிமுறைகள் மற்றும் நிபந்தனைகள்

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය
ta: தனியுரிமைக் கொள்கை

source: Home
si: මුල් පිටුව
ta: முகப்பு

source: Messages
si: පණිවිඩ
ta: செய்திகள்

source: Settings
si: සැකසුම්
ta: அமைப்புகள்

source: Pay
si: ගෙවන්න
ta: கொடு

source: Total Payable
si: ගෙවිය යුතු මුළු මුදල
ta: மொத்த செலுத்த வேண்டிய தொகை

source: Payable Amount
si: ගෙවිය යුතු මුදල
ta: செலுத்த வேண்டிய தொகை

source: Account Number
si: ගිණුම් අංකය
ta: கணக்கு எண்

source: Amount
si: මුදල
ta: தொகை

source: Next
si: ඊළඟ
ta: அடுத்தது

source: Payment Gateway
si: ගෙවීම් ද්වාරය
ta: கட்டண நுழைவாயில்

source: Receipt
si: රසීදුව
ta: ரசீது

source: Done
si: සම්පූර්ණයි
ta: முடிந்தது

source: Sign Out
si: පිටවන්න
ta: வெளியேறவும்

source: Change Language
si: භාෂාව වෙනස් කරන්න
ta: மொழியை மாற்றவும்

# no_messages
source: No messages available
si: පණිවිඩ නැත
ta: செய்திகள் இல்லை

source: Payment Successful
si: ගෙවීම සාර්ථකයි
ta: கட்டணம் வெற்றிகரமாக செலுத்தப்பட்டது

source: Download Receipt
si: රසීදුව බාගන්න
ta: ரசீதைப் பதிவிறக்கவும்

# password_reset_success
source: Password reset link sent to your email
si: මුරපදය නැවත සකසීම සාර්ථකයි
ta: கடவுச்சொல் மீட்டமைப்பு வெற்றிகரமாக முடிந்தது

source: Password reset failed
si: මුරපදය නැවත සකසීම අසාර්ථකයි
ta: கடவுச்சொல் மீட்டமைப்பு தோல்வியடைந்தது

source: Password Reset
si: මුරපදය නැවත සකසන්න
ta: கடவுச்சொல் மீட்டமைக்கவும்

# password_mismatch
source: Passwords do not match
si: මුරපද නොගැලපේ
ta: கடவுச்சொல் பொருந்தவில்லை

source: Update failed
si: යාවත්කාලීන කිරීම අසාර්ථකයි
ta: புதுப்பிப்பு தோல்வியடைந்தது

source: Update Profile
si: පැතිකඩ යාවත්කාලීන කරන්න
ta: சுயவிவரத்தை புதுப்பிக்கவும்

# profile_updated
source: Profile updated successfully
si: පැතිකඩ යාවත්කාලීන කරන ලදී
ta: சுயவிவரம் புதுப்பிக்கப்பட்டது

# update_profile_failed
source: Profile update failed
si: පැතිකඩ යාවත්කාලීන කිරීම අසාර්ථකයි
ta: சுயவிவரத்தை புதுப்பிக்க முடியவில்லை

source: Update Profile Picture
si: පැතිකඩ රූපය යාවත්කාලීන කරන්න
ta: சுயவிவரப் படத்தை புதுப்பிக்கவும்

source: Upload Picture
si: රූපය උඩුගත කරන්න
ta: படத்தை பதிவேற்றவும்

source: Select Picture
si: රූපයක් තෝරන්න
ta: படத்தைத் தேர்ந்தெடுக்கவும்

source: Profile
si: පැතිකඩ
ta: சுயவிவரம்

source: Edit Profile
si: පැතිකඩ සංස්කරණය කරන්න
ta: சுயவிவரத்தைத் திருத்தவும்

source: Change Password
si: මුරපදය වෙනස් කරන්න
ta: கடவுச்சொல்லை மாற்றவும்

source: Current Password
si: වත්මන් මුරපදය
ta: தற்போதைய கடவுச்சொல்

# current_password_incorrect
source: Current password is incorrect
si: වත්මන් මුරපදය වැරදියි
ta: தற்போதைய கடவுச்சொல் தவறானது

# current_password_required
source: Current password is required
si: වත්මන් මුරපදය අවශ්‍යයි
ta: தற்போதைய கடவுச்சொல் தேவை

# new_password_required
source: New password is required
si: නව මුරපදය අවශ්‍යයි
ta: புதிய கடவுச்சொல் தேவை

# confirm_password_required
source: Confirm password is required
si: මුරපදය තහවුරු කිරීම අවශ්‍යයි
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும் தேவை

source: Dashboard
si: පුවරුව
ta: டாஷ்போர்டு

source: Bill
si: බිල්පත්
ta: பில்

source: Total Amount Due
si: ගෙවිය යුතු මුළු මුදල
ta: மொத்த நிலுவைத் தொகை

source: Payment Details
si: ගෙවීම් විස්තර
ta: கட்டண விவரங்கள்

source: Confirm Payment
si: ගෙවීම තහවුරු කරන්න
ta: கட்டணத்தை உறுதிப்படுத்தவும்

source: Confirm Payment of
si: ගෙවීම තහවුරු කරන්න
ta: கட்டணத்தை உறுதிப்படுத்தவும்

source: Pay Now
si: දැන් ගෙවන්න
ta: இப்போது செலுத்தவும்

source: Proceed with Payment
si: ගෙවීමේ ක්‍රියාවලියට යන්න
ta: கட்டணத்துடன் தொடரவும்

source: Cancel
si: අවලංගු කරන්න
ta: ரத்துசெய்

source: Proceed to Payment
si: ගෙවීමේ ක්‍රියාවලියට යන්න
ta: கட்டணத்திற்கு செல்லவும்

source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

source: No new notifications
si: නව දැනුම්දීම් නැත
ta: புதிய அறிவிப்புகள் இல்லை

source: Back to Dashboard
si: පුවරුවට ආපසු
ta: டாஷ்போர்டுக்கு திரும்பவும்

# no_outstanding_liabilities
source: You have no outstanding liabilities.
si: අදාල වගකීම් නැත
ta: நிலுவை பொறுப்புகள் இல்லை

source: Bill Payments
si: බිල් ගෙවීම්
ta: பில் கட்டணங்கள்

source: No bills available
si: බිල්පත් නොමැත
ta: பில்கள் இல்லை

source: No new messages
si: නව පණිවිඩ නැත
ta: புதிய செய்திகள் இல்லை

source: Select Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Sign Out
si: පිටවන්න
ta: வெளியேறவும்

# settings_title
source: Settings
si: සැකසුම්
ta: அமைப்புகள் தலைப்பு

source: Select Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடுக்கவும்

# helloUser
source: Hello {name},
si: ආයුබෝවන්
ta: வணக்கம் பயனர்

source: Welcome back
si: සාදරයෙන් පිළිගනිමු
ta: வரவேற்கிறோம்

source: My Liabilities
si: මගේ වගකීම්
ta: என் பொறுப்புகள்

source: See details
si: විස්තර බලන්න
ta: விவரங்களைப் பார்க்கவும்

# nextInstallment
source: Next Month Installment
si: ඊළඟ මාසයේ වාරිකය
ta: அடுத்த தவணை

# supportMessage
source: If there is any problem, don't panic
si: සහාය පණිවිඩය
ta: ஆதரவு செய்தி

# supportDescription
source: For any issues or concerns, feel free to reach out to our support team. We're here to help! 😊❤
si: ඕනෑම ගැටළුවක් සඳහා, අපගේ සහාය කණ්ඩායම අමතන්න. අපි උදව් කිරීමට මෙහි සිටිමු! 😊❤
ta: சிக்கல் ஏற்பட்டால், எங்களை தொடர்புகொள்ளுங்கள். உதவத் தயாராக உள்ளோம்! 😊❤

source: Payments
si: ගෙවීම්
ta: கட்டணங்கள்

source: Full Name
si: සම්පූර්ණ නම
ta: முழு பெயர்

source: NIC Number
si: ජාතික හැඳුනුම්පත් අංකය
ta: தேசிய அடையாள அட்டை எண்

source: Address
si: ලිපිනය
ta: முகவரி

source: Birth Day
si: උපන් දිනය
ta: பிறந்த நாள்

source: Gender
si: ස්ත්‍රී පුරුෂ භාවය
ta: பாலினம்

source: Land Line
si: ස්ථාවර දුරකථන
ta: நிலையான தொலைபேசி

source: Mobile
si: ජංගම දුරකථන
ta: மொபைல்

source: Clear All
si: සියල්ල මකන්න
ta: அனைத்தையும் அழிக்கவும்

# no_new_notifications_message
source: We’ll let you know when there will be something to update you.
si: නව දැනුම්දීම් නැත
ta: புதிய அறிவிப்புகள் இல்லை

source: Total Arrears:
si: මුළු පසුගාමී මුදල්
ta: மொத்த நிலுவைத் தொகை

source: Last Bill Amount
si: අවසන් බිල්පතේ මුදල
ta: கடைசி பில் தொகை

source: Last Payment Amount
si: අවසන් ගෙවීමේ මුදල
ta: கடைசி கட்டண தொகை

source: My Liability
si: මගේ වගකීම
ta: என் பொறுப்பு

source: Your Finance Details
si: ඔබේ මූල්‍ය විස්තර
ta: உங்கள் நிதி விவரங்கள்

# myFinanceWere
source: My Finances Were
si: මගේ ෆිනෑන්ස් කටයුතු
ta: நான் பெற்ற தொகை

source: First Name:
si: මුල් නම
ta: முதல் பெயர்

source: Vehicle Number:
si: වාහන අංකය
ta: வாகன எண்

source: Loan Amount:
si: ණය මුදල
ta: கடன் தொகை

source: Opening Date:
si: ආරම්භක දිනය
ta: திறந்த தேதி

source: Interest Rate:
si: පොලී අනුපාතය
ta: வட்டி விகிதம்

source: Maturity Date:
si: පරිණාම දිනය
ta: முடிவுத் தேதி

source: Balance:
si: ශේෂය
ta: மீதி

source: Next Installment Date:
si: ඊළඟ වාරික දිනය
ta: அடுத்த தவணை தேதி

source: Next Installment Amount:
si: ඊළඟ වාරික මුදල
ta: அடுத்த தவணை தொகை

source: Remaining Installments:
si: ඉතිරි වාරික
ta: மீதமுள்ள தவணைகள்

source: Call
si: ඇමතුමක්
ta: அழைப்பு

source: WhatsApp
si: වට්ස්ඇප්
ta: வாட்ஸ்அப்

source: Website
si: වෙබ් අඩවිය
ta: இணையதளம்

source: Fax
si: ෆැක්ස්
ta: தொலைநகல்

source: Mail
si: තැපැල්
ta: மின்னஞ்சல்

source: Message
si: පණිවිඩය
ta: செய்தி

source: Location
si: ස්ථානය
ta: இடம்

source: Payment
si: ගෙවීම
ta: கட்டணம்

source: Amount to be paid
si: ගෙවිය යුතු මුදල
ta: செலுத்த வேண்டிய தொகை

source: Pay Bill
si: බිල් ගෙවන්න
ta: பில் செலுத்தவும்

source: Pay Amount
si: මුදල ගෙවන්න
ta: தொகையை செலுத்தவும்

# payment_success_title
source: Payment Successful
si: ගෙවීම සාර්ථකයි
ta: கட்டணம் வெற்றிகரமாக முடிந்தது

# payment_success_subtitle
source: Your payment was successful!
si: ගෙවීම සාර්ථකව සිදු කරන ලදී
ta: உங்கள் கட்டணம் வெற்றிகரமாக முடிந்தது

source: Payment Status
si: ගෙවීම් තත්ත්වය
ta: கட்டண நிலை

source: Success
si: සාර්ථකයි
ta: வெற்றி

source: Name
si: නම
ta: பெயர்

source: Sender
si: යවන්නා
ta: அனுப்புநர்

source: Get PDF Receipt
si: PDF රසීදුව ලබාගන්න
ta: PDF ரசீதைப் பெறவும்

source: Opening with viewer...
si: දර්ශකය සමඟ විවෘත වෙමින්
ta: பார்வையாளருடன் திறக்கிறது

source: Opening remote file...
si: දුරස්ථ ගොනුව විවෘත කරමින්
ta: தொலைநிலை கோப்பைத் திறக்கிறது

source: File Services
si: ගොනු සේවා
ta: கோப்பு சேவைகள்

source: Message Details
si: විස්තරය
ta: செய்தி விவரங்கள்

source: Date not available
si: දිනය ලබා ගත නොහැක
ta: தேதி கிடைக்கவில்லை

# no_content
source: No content available
si: අන්තර්ගතයක් නැත
ta: உள்ளடக்கம் இல்லை

source: Downloading...
si: බාගත වෙමින්
ta: பதிவிறக்குகிறது

source: Open
si: විවෘත කරන්න
ta: திறக்கவும்

source: Share
si: බෙදාගන්න
ta: பகிரவும்

source: File URL not available
si: ගොනු URL ලබාගත නොහැක
ta: கோப்பு URL கிடைக்கவில்லை

source: Opening...
si: විවෘත වෙමින්
ta: திறக்கிறது

# file_ready_opening
source: File is ready. Opening...
si: ගොනුව සූදානම්, විවෘත වෙමින්
ta: கோப்பு தயார், திறக்கிறது

source: Download failed
si: බාගැනීම අසාර්ථකයි
ta: பதிவிறக்கம் தோல்வியடைந்தது

# no_app_for_file
source: No app available to open this file
si: ගොනුව සඳහා යෙදුමක් නොමැත
ta: இந்த கோப்புக்கான பயன்பாடு இல்லை

source: Opening failed. Downloading...
si: විවෘත කිරීම අසාර්ථකයි, බාගත වෙමින්
ta: திறப்பது தோல்வியடைந்தது, பதிவிறக்குகிறது

source: Storage permission required
si: ගබඩා අවසරය අවශ්‍යයි
ta: சேமிப்பக அனுமதி தேவை

source: File downloaded
si: ගොනුව බාගත කරන ලදී
ta: கோப்பு பதிவிறக்கப்பட்டது

source: Download error
si: බාගැනීමේ දෝෂයක්
ta: பதிவிறக்க பிழை

# notifications_title
source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள் தலைப்பு

source: Change Username
si: පරිශීලක නාමය වෙනස් කරන්න
ta: பயனர் பெயரை மாற்றவும்

source: Two-Factor Authentication
si: දෙකේ මට්ටමේ සත්‍යාපනය
ta: இரண்டு காரணி அங்கீகாரம்

source: Language
si: භාෂාව
ta: மொழி

source: App Lock
si: යෙදුම් අගුල
ta: பயன்பாட்டு பூட்டு

source: notification
si: දැනුම්දීම්
ta: அறிவிப்பு

source: Invalid NIC format
si: අවලංගු ජාතික හැඳුනුම්පත් ආකෘතිය
ta: தவறான NIC வடிவம்

source: NIC not registered
si: ජාතික හැඳුනුම්පත් අංකය ලියාපදිංචි කර නැත
ta: NIC பதிவு செய்யப்படவில்லை

source: Error checking NIC
si: ජාතික හැඳුනුම්පත් අංකය පරීක්ෂා කිරීමේ දෝෂය
ta: NIC சரிபார்க்கும் பிழை

source: Verification failed
si: සත්‍යාපනය අසාර්ථකයි
ta: சரிபார்ப்பு தோல்வியடைந்தது

# verification_failed_message
source: Verification failed. Please try again.
si: සත්‍යාපනය අසාර්ථකයි
ta: சரிபார்ப்பு தோல்வியடைந்தது

# nic_required
source: NIC is required
si: ජාතික හැඳුනුම්පත් අංකය අවශ්‍යයි
ta: NIC தேவை

source: Verify NIC
si: ජාතික හැඳුනුම්පත් අංකය සත්‍යාපනය කරන්න
ta: NIC ஐ சரிபார்க்கவும்

# phone_required
source: Phone number is required
si: දුරකථන අංකය අවශ්‍යයි
ta: தொலைபேசி தேவை

# invalid_phone_format
source: Invalid phone number format
si: අවලංගු දුරකථන අංක ආකෘතිය
ta: தவறான தொலைபேசி வடிவம்

# sign_in_help_text
source: Please enter your email and password to sign in.
si: ඇතුල් වීමේ උපකාර
ta: உள்நுழைவு உதவி உரை

# invalid_phone
source: Invalid phone number
si: අවලංගු දුරකථන අංකය
ta: தவறான தொலைபேசி

# otp_verification
source: Verification
si: සත්‍යාපනය
ta: சரிபார்ப்பு

source: Verification Code
si: සත්‍යාපන කේතය
ta: சரிபார்ப்பு குறியீடு

source: Code sent to
si: කේතය යවනු ලැබුවේ
ta: குறியீடு அனுப்பப்பட்டது

source: Verify
si: සත්‍යාපනය කරන්න
ta: சரிபார்ப்பு

# didnt_receive_code
source: Didn't receive the code?
si: කේතය ලැබුනේ නැද්ද?
ta: குறியீடு இல்லையா?

source: Resend
si: නැවත යවන්න
ta: மீண்டும்

# nic_help_text
source: Please enter your NIC number for verification.
si: ජාතික හැඳුනුම්පත් අංකය සත්‍යාපනය කරන්න
ta: NIC உதவி உரை

# nic_verification
source: Verification
si: ජාතික හැඳුනුම්පත් අංකය සත්‍යාපනය
ta: சரிபார்ப்பு

# enter_nic
source: Enter correct NIC
si: ජාතික හැඳුනුම්පත් අංකය ඇතුළත් කරන්න
ta: NIC ஐ உள்ளிடவும்

# nic_verification_message
source: Verify your identity.
si: හැඳුනුම්පත් අංකය සත්‍යාපනය කරන්න
ta: ஐடி எண்ணைச் சரிபார்க்கவும்

source: Phone Number
si: දුරකථන අංකය
ta: தொலைபேசி

source: Customer ID
si: පාරිභෝගික හැඳුනුම්පත් අංකය
ta: வாடிக்கையாளர் ஐடி

source: minutes ago
si: මිනිත්තු කිහිපයකට පෙර
ta: நிமிடங்களுக்கு முன்

source: hours ago
si: පැය කිහිපයකට පෙර
ta: மணிநேரங்களுக்கு முன்

source: days ago
si: දින කිහිපයකට පෙර
ta: நாட்களுக்கு முன்

source: Unknown date
si: නොදන්නා දිනය
ta: தெரியாத தேதி

source: Reference
si: යොමු
ta: குறிப்பு

source: Close
si: වසන්න
ta: மூடவும்

source: Reply
si: පිළිතුරු
ta: பதில்

source: Clear All Notifications
si: සියලු දැනුම්දීම් මකන්න
ta: அனைத்து அறிவிப்புகளையும் அழிக்கவும்

# clear_all_confirmation
source: Are you sure you want to clear all notifications?
si: සියල්ල මකන්න
ta: அனைத்தையும் அழிக்க உறுதிப்படுத்தவும்

source: Delete All
si: සියල්ල මකන්න
ta: அனைத்தையும் நீக்கவும்

source: Refresh
si: නැවත සකසන්න
ta: புதுப்பிக்கவும்

source: Error loading notifications
si: දැනුම්දීම් පූරණය කිරීමේ දෝෂය
ta: அறிவிப்புகளை ஏற்றுவதில் பிழை

# failed_load_notifications
source: Failed to load notifications
si: දැනුම්දීම් පූරණය අසාර්ථකයි
ta: அறிவிப்புகளை ஏற்ற முடியவில்லை

source: Try Again
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சிக்கவும்

source: Loading notifications...
si: දැනුම්දීම් පූරණය වෙමින්
ta: அறிவிப்புகளை ஏற்றுகிறது

source: Attachments
si: ඇමුණුම්
ta: இணைப்புகள்

source: Download
si: බාගන්න
ta: பதிவிறக்கவும்

# image_load_error
source: Error loading image
si: රූපය පූරණය කිරීමේ දෝෂය
ta: படத்தை ஏற்றுவதில் பிழை

source: Attachment
si: ඇමුණුම
ta: இணைப்பு

source: Delete
si: මකන්න
ta: நீக்கவும்

source: More Attachments
si: තවත් ඇමුණුම්
ta: மேலும் இணைப்புகள்

source: More Attachment
si: තවත් ඇමුණුම
ta: மேலும் இணைப்பு

# clear_all_notifications_confirm
source: Are you sure you want to clear all notifications? This action cannot be undone.
si: සියලු දැනුම්දීම් මකන්න
ta: அனைத்து அறிவிப்புகளையும் அழிக்க உறுதிப்படுத்தவும்

source: Notifications cleared
si: දැනුම්දීම් මකා දමන ලදී
ta: அறிவிப்புகள் அழிக்கப்பட்டன

source: Clear
si: මකන්න
ta: அழிக்கவும்

source: Retry
si: නැවත උත්සාහ කරන්න
ta: மீண்டும் முயற்சிக்கவும்

# no_notifications
source: No notifications available
si: දැනුම්දීම් නැත
ta: அறிவிப்புகள் இல்லை

# no_notifications_message
source: You have no notifications at the moment.
si: නව දැනුම්දීම් නැත
ta: அறிவிப்புகள் இல்லை

source: Today
si: අද
ta: இன்று

source: Open Link
si: සබැඳිය විවෘත කරන්න
ta: இணைப்பைத் திறக்கவும்

# clear_all_notifications_message
source: Are you sure you want to clear all notifications? This action cannot be undone.
si: සියලු දැනුම්දීම් මකන්න
ta: அனைத்து அறிவிப்புகளையும் அழிக்கவும்

# enter_valid_nic_and_phone
source: Enter a valid NIC and phone number.
si: වලංගු හැඳුනුම්පත් අංකයක් සහ දුරකථන අංකයක් ඇතුළත් කරන්න
ta: சரியான ஐடி எண் மற்றும் மொபைல் எண்ணை வழங்கவும்

# enter_valid_nic
source: Enter a valid NIC.
si: වලංගු හැඳුනුම්පත් අංකයක් ඇතුළත් කරන්න
ta: சரியான ஐடி எண்ணை உள்ளிடவும்.

# nic_incorrect_format
source: NIC is in incorrect format.
si: ජාතික හැඳුනුම්පත් අංක ආකෘතිය වැරදියි
ta: ஐடி எண் வடிவம் தவறானது

# enter_valid_phone
source: Enter a valid phone number.
si: වලංගු දුරකථන අංකයක් ඇතුළත් කරන්න
ta: சரியான எண்ணை உள்ளிடவும்

# phone_must_be_10_digits
source: Phone number is in incorrect format.
si: දුරකථන අංකය අංක 10ක් විය යුතුය
ta: எண் வடிவம் தவறானது

source: No notifications yet
si: තවම දැනුම්දීම් නැත
ta: அறிவிப்புகள் எதுவும் இல்லை

# connection_error
source: Check your connection and Try again
si: සම්බන්ධතාවයේ දෝෂයක්
ta: இணைப்பு பிழை

source: validating...
si: සත්‍යාපනය...
ta: சரிபார்க்கிறது...

source: verifying...
si: සත්‍යාපනය...
ta: சரிபார்க்கிறது...

# enter_valid_6digit_code
source: Enter a valid 6-digit code
si: වලංගු අංක 6ක කේතය ඇතුළත් කරන්න
ta: சரியான குறியீட்டை உள்ளிடவும்

# enter_correct_otp
source: Enter the correct OTP
si: නිවැරදි කේතය ඇතුළත් කරන්න
ta: சரியான குறியீடு கொடு

source: Verification code sent again
si: සත්‍යාපන කේතය නැවත යවා ඇත
ta: சரிபார்ப்பு குறியீடு மீண்டும் அனுப்பப்பட்டது

# code_timed_out
source: Request has timed out.Try again
si: කාලය අවසන් නැවත උත්සාහ කරන්න
ta: நேரம் முடிந்தது மீண்டும் முயற்சிக்கவும்

# nic_verification_heading
source: Validate
si: සත්‍යාපනය
ta: சரிபார்ப்பு

# enter_valid_nic_number
source: Enter the correct NIC
si: හැඳුනුම්පත් අංකය
ta: ஐடி எண்

source: Completed
si: අවසන් විය
ta: முடிந்தது

source: On
si: සියල්ල
ta: தேதி

source: Anuradhapura
si: අනුරාධපුරය
ta: அனுராதபுரம்

source: Unicon Finance
si: යුනිකොන් ෆිනෑන්ස්
ta: யுனிகோன் ஃபைனான்ஸ்

source: Tap to view on map
si: සිතියමෙහි බැලීමට ස්පර්ශ කරන්න
ta: வரைபடத்தில் பார்க்க தட்டவும்

source: Biometrics
si: ජෛවමිතික
ta: பயோமெட்ரிக்ஸ்

source: Set up PIN
si: පින් අංකය සකසන්න
ta: பின் அமைக்கவும்

# create_pin_message
source: Create a 4-digit PIN to secure your account.
si: ඔබගේ යෙදුම ආරක්ෂා කිරීමට පින් අංකයක් සාදන්න
ta: உங்கள் கணக்கை பாதுகாக்க பின் உருவாக்கவும்

source: Support
si: සහය
ta: ஆதரவு

source: Copied
si: පිටපත් කරන ලදී
ta: நகல்

source: Preparing to share...
si: බෙදාගැනීම සඳහා සූදානම් වෙමින්
ta: பகிர தயாராகிறது

source: Sharing...
si: බෙදාගනිමින්
ta: பகிர்கிறது

source: Sharing error
si: බෙදාගැනීම අසාර්ථකයි
ta: பகிர்வதில் பிழை

source: Downloading for viewing...
si: බැලීම සඳහා බාගත වෙමින්
ta: பார்வையிடுவதற்காகப் பதிவிறக்குகிறது

source: All
si: සියල්ල
ta: அனைத்தும்

source: Unread
si: නොකියවූ
ta: படிக்காதவை

source: Mark all as read
si: සියල්ල කියවූ ලෙස සලකුණු කරන්න
ta: அனைத்தையும் படித்ததாகக் குறிக்கவும்

# view
source: View all
si: බලන්න
ta: பார்க்க

# notification_empty_message
source: No notifications available
si: දැනුම්දීම් කිසිවක් නැත
ta: அறிவிப்புகள் எதுவும் இல்லை

# delete_notification_confirmation
source: Are you sure you want to delete this notification?
si: දැනුම්දීම මකන්න?
ta: அறிவிப்பை நீக்க உறுதிப்படுத்தவும்

source: Delete Notification
si: දැනුම්දීම මකන්න
ta: அறிவிப்பை நீக்கவும்

source: Error deleting message
si: පණිවිඩය මැකීමේ දෝෂයක්
ta: செய்தியை நீக்குவதில் பிழை

source: Enter PIN
si: පින් අංකය ඇතුළත් කරන්න
ta: பின்னை உள்ளிடவும்

source: Confirm PIN
si: පින් අංකය තහවුරු කරන්න
ta: பின்னை உறுதிப்படுத்தவும்

source: Profile image updated
si: පැතිකඩ රූපය යාවත්කාලීන කරන ලදී
ta: சுயவிவரப் படம் புதுப்பிக்கப்பட்டது

source: Profile image update failed
si: පැතිකඩ රූපය යාවත්කාලීන කිරීම අසාර්ථකයි
ta: சுயவிவரப் படத்தைப் புதுப்பிக்க முடியவில்லை

source: Clean App Data
si: දත්ත පිරිසිදු කරන්න
ta: தரவை அழிக்கவும்

# clean_app_data_message
source: This will remove all app data and reset the app to its initial state.
si: සියලුම යෙදුම් දත්ත මකා දැමීමට අවශ්‍යද?
ta: இது எல்லா உள்ளூர் தரவையும் அழித்துவிடும். தொடர விரும்புகிறீர்களா?

# data_cleaned_restarting
source: Data cleaned. Restarting app...
si: දත්ත පිරිසිදු කර නැවත ආරම්භ වෙමින්...
ta: தரவு அழிக்கப்பட்டது, மறுதொடக்கம் செய்கிறது...

# sign_out_confirm_message
source: Are you sure you want to sign out?
si: ඔබට පිටවීමට අවශ්‍ය බව විශ්වාසද?
ta: வெளியேற விரும்புகிறீர்களா?

# sign_out_error
source: Error signing out
si: පිටවීමේ දෝෂයකි
ta: வெளியேற முடியவில்லை

source: Auto Sign Out
si: ස්වයංක්‍රීය පිටවීම
ta: சுய விலகல்

source: Clean Data
si: දත්ත පිරිසිදු කරන්න
ta: தரவை அழிக்கவும்

source: About Us
si: අපි ගැන
ta: எங்களைப் பற்றி

source: App Guide
si: යෙදුම් මාර්ගෝපදේශය
ta: பயன்பாட்டு வழிகாட்டி

# cancel_clean
source: Cancel
si: අවශ්‍යය නැත
ta: இல்லை

# confirm_clean
source: Confirm
si: අවශ්‍යයි
ta: விரும்புகிறேன்

# confirm_pin_message
source: Confirm your 4-digit PIN.
si: ඔබගේ පින් අංකය තහවුරු කිරීම සඳහා නැවත ඇතුළත් කරන්න
ta: உங்கள் பின்னை உறுதிப்படுத்தவும்

source: Save PIN
si: පින් අංකය සුරකින්න
ta: பின்னை சேமிக்கவும்

source: Disable
si: අක්‍රිය කරන්න
ta: முடக்கவும்

source: Delete Message
si: පණිවිඩය මකන්න
ta: செய்தியை நீக்கவும்

# delete_message_confirmation
source: Are you sure you want to delete this message?
si: මෙම පණිවිඩය මැකීමට අවශ්‍යද?
ta: செய்தியை நீக்க உறுதிப்படுத்தவும்

source: Clear All Messages
si: සියලු පණිවිඩ මකන්න
ta: அனைத்து செய்திகளையும் அழிக்கவும்

# clear_all_messages_confirmation
source: Are you sure you want to clear all messages?
si: සියලු පණිවිඩ මැකීමට අවශ්‍යද?
ta: அனைத்து செய்திகளையும் அழிக்க உறுதிப்படுத்தவும்

source: Loading messages...
si: පණිවිඩ පූරණය වෙමින්...
ta: செய்திகளை ஏற்றுகிறது

source: Monthly Installment
si: මාසික වාරිකය
ta: மாதாந்திர தவணை

source: Remaining Balance Due
si: ඉතිරිව ඇති ශේෂය
ta: மீதமுள்ள இருப்பு

source: Paid
si: ගෙවා ඇත
ta: செலுத்தினார்

source: Includes Arrears Installments
si: හිඟ වාරික ඇතුළත් වේ
ta: + நிலுவை தொகை

source: Bill Summary
si: බිල්පත් සාරාංශය
ta: பில் சுருக்கம்

source: Monthly Bill
si: මාසික බිල්පත
ta: மாதாந்திர பில்

source: Current Bill
si: වත්මන් බිල්පත
ta: தற்போதைய பில்

source: Bills
si: බිල්පත්
ta: பில்கள்
